I've `terraform import`ed most of the things in chainguard-images. Unfortunately there's still this diff:

```
  # module.gclb.google_certificate_manager_certificate.cert["cgr.dev"] must be replaced
-/+ resource "google_certificate_manager_certificate" "cert" {
      ~ id      = "projects/chainguard-images/locations/global/certificates/cgr-dev" -> (known after apply)
      - labels  = {} -> null
        name    = "cgr-dev"
      ~ project = "chainguard-images" -> (known after apply)

      ~ managed {
          ~ authorization_attempt_info = [
              - {
                  - details        = ""
                  - domain         = "cgr.dev"
                  - failure_reason = ""
                  - state          = "AUTHORIZED"
                },
            ] -> (known after apply)
          ~ dns_authorizations         = [ # forces replacement
              + "projects/chainguard-images/locations/global/dnsAuthorizations/cgr-dev",
            ]
          ~ provisioning_issue         = [] -> (known after apply)
          ~ state                      = "ACTIVE" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      - timeouts {}
    }
```

As I understand it, this means the cert will get deleted and re-created -- with the exact same DNS authorization we already have today. I think this will give us a few minutes of downtime while the cert provisions and DNS-authorizes.

I'm not sure if there's a better way to import this state so that TF doesn't think it has to delete and re-create the certs. 😒 